In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = pd.read_csv('list.csv')
dframe

   q  r  s  t  apple
0  a  b  c  d    cat
1  d  e  f  g   code
2  p  o  i  u    gym

In [4]:
dframe = pd.read_csv('list.csv', header=None)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d     cat
2  d  e  f  g    code
3  p  o  i  u     gym

In [5]:
dframe = pd.read_csv('list.csv',sep=',', header=None)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d     cat
2  d  e  f  g    code
3  p  o  i  u     gym

In [7]:
dframe = pd.read_csv('list.csv', header=None,nrows=2)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d     cat

In [8]:
dframe.to_csv('mytextdata.csv') # creating a csv file.

In [13]:
import sys
dframe = pd.read_csv('list.csv', header=None)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d     cat
2  d  e  f  g    code
3  p  o  i  u     gym

In [14]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t, apple
1,a,b,c,d, cat
2,d,e,f,g, code
3,p,o,i,u, gym

In [15]:
dframe.to_csv(sys.stdout, sep='-')
dframe

-0-1-2-3-4
0-q-r-s-t- apple
1-a-b-c-d- cat
2-d-e-f-g- code
3-p-o-i-u- gym

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d     cat
2  d  e  f  g    code
3  p  o  i  u     gym

In [16]:
dframe.to_csv(sys.stdout, columns=[0,1,2])

,0,1,2
0,q,r,s
1,a,b,c
2,d,e,f
3,p,o,i